# RbsElecAnalyticalAreaParam Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ParameterTypeId..::..RbsElecAnalyticalAreaParam Property
ParameterTypeId Class See Also
---
"Specified Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecAnalyticalAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecAnalyticalAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecAnalyticalAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace